panda5mt/RA8E1_prj/src/hyperram_integ.c
#include "hyperram_integ.h"
#include "main_thread1.h"
#include "putchar_ra8usb.h"
#include "hal_data.h"

#include "r_ospi_b.h"
#include "r_spi_flash_api.h"
#include <string.h>
#include <stdint.h>
#include "verify_mode.h"
#include "FreeRTOS.h"
#include "semphr.h"

/*
 * Debug aid: verify memory-mapped HyperRAM writes by immediate read-back.
 * Enabled by default in FFT verification mode to help quantify/mitigate persistent mismatches.
 */
#ifndef HYPERRAM_WRITE_VERIFY
#if defined(APP_MODE_FFT_VERIFY) && (APP_MODE_FFT_VERIFY != 0)
#define HYPERRAM_WRITE_VERIFY 1
#else
#define HYPERRAM_WRITE_VERIFY 0
#endif
#endif

#ifndef HYPERRAM_WRITE_VERIFY_RETRIES
/* Number of re-write attempts after the initial write when mismatch is detected. */
#define HYPERRAM_WRITE_VERIFY_RETRIES 1
#endif

#ifndef HYPERRAM_WRITE_VERIFY_LOG
/* 0: silent (preferred). 1: print per-call summary when retries/failures occurred. */
#define HYPERRAM_WRITE_VERIFY_LOG 0
#endif

/*
 * EXPERIMENT (unsafe): increase the memory-mapped RW chunk size.
 *
 * IMPORTANT:
 * This project uses an OSPI address conversion that is effectively 16-byte granular.
 * The safe path never crosses a 16-byte boundary within one contiguous RW chunk.
 *
 * To intentionally test what happens when we do cross boundaries (potentially faster
 * but may corrupt/interleave data), enable the following switch.
 */
#ifndef HYPERRAM_UNSAFE_RW_CROSS_16B
#define HYPERRAM_UNSAFE_RW_CROSS_16B 1
#endif

#ifndef HYPERRAM_RW_CHUNK_SIZE
#if HYPERRAM_UNSAFE_RW_CROSS_16B
#define HYPERRAM_RW_CHUNK_SIZE 64U
#else
#define HYPERRAM_RW_CHUNK_SIZE 16U
#endif
#endif

/*
 * When verifying memory-mapped writes, optionally wait for the OSPI mmap engine
 * to become idle before reading back / retrying.
 * This adds little overhead in the common case, but can reduce rare persistent
 * mismatches (fail=1) under high bus contention.
 */
#ifndef HYPERRAM_WV_WAIT_MMAP_IDLE
#if HYPERRAM_UNSAFE_RW_CROSS_16B
#define HYPERRAM_WV_WAIT_MMAP_IDLE 1
#else
#define HYPERRAM_WV_WAIT_MMAP_IDLE 0
#endif
#endif

/* Flash device timing */
#define OSPI_B_TIME_UNIT (BSP_DELAY_UNITS_MICROSECONDS)
#define OSPI_B_TIME_RESET_SETUP (2U)    /*  Type 50ns */
#define OSPI_B_TIME_RESET_PULSE (1000U) /*  Type 500us */

spi_flash_direct_transfer_t g_ospi0_trans;
bool ospi_b_dma_sent = false;
static bool g_ospi_initialized = false;

/* HyperRAMスレッドセーフアクセス管理（ミューテックスベース） */
static SemaphoreHandle_t g_hyperram_mutex = NULL;

/* HyperRAM write verify/retry counters (for diagnostics). */
static volatile uint32_t g_hyperram_wv_mismatch_chunks = 0;
static volatile uint32_t g_hyperram_wv_retries = 0;
static volatile uint32_t g_hyperram_wv_failed_chunks = 0;

#if HYPERRAM_WRITE_VERIFY && HYPERRAM_UNSAFE_RW_CROSS_16B
static bool hyperram_wv_safe_rewrite_verify(const uint8_t *src,
                                            volatile uint8_t *dst8,
                                            uint32_t write_size)
{
    uint32_t sub_offset = 0;

    while (sub_offset < write_size)
    {
        uint32_t sub_remaining = write_size - sub_offset;
        uintptr_t base_addr = (uintptr_t)(dst8 + sub_offset);
        uint32_t in_block = (uint32_t)(base_addr & 0x0FU);
        uint32_t to_block_end = 16U - in_block;
        uint32_t sub_size = sub_remaining;

        if (sub_size > to_block_end)
        {
            sub_size = to_block_end;
        }

        const uint8_t *sub_src = src + sub_offset;
        volatile uint8_t *sub_dst8 = dst8 + sub_offset;

        if ((((uintptr_t)sub_src | (uintptr_t)sub_dst8 | (uintptr_t)sub_size) & 0x3u) == 0u)
        {
            const uint32_t *src32 = (const uint32_t *)sub_src;
            volatile uint32_t *dst32 = (volatile uint32_t *)sub_dst8;
            uint32_t words = sub_size >> 2;
            for (uint32_t i = 0; i < words; i++)
            {
                dst32[i] = src32[i];
            }
        }
        else
        {
            for (uint32_t i = 0; i < sub_size; i++)
            {
                sub_dst8[i] = sub_src[i];
            }
        }

#if HYPERRAM_WV_WAIT_MMAP_IDLE
        ospi_wait_mmap_idle();
#endif
        __DSB();
        __ISB();

        uint8_t rb[16];
        if ((((uintptr_t)sub_dst8 | (uintptr_t)sub_size) & 0x3u) == 0u)
        {
            const volatile uint32_t *src32 = (const volatile uint32_t *)sub_dst8;
            uint32_t *rb32 = (uint32_t *)rb;
            uint32_t words = sub_size >> 2;
            for (uint32_t i = 0; i < words; i++)
            {
                rb32[i] = src32[i];
            }
        }
        else
        {
            for (uint32_t i = 0; i < sub_size; i++)
            {
                rb[i] = sub_dst8[i];
            }
        }

        for (uint32_t i = 0; i < sub_size; i++)
        {
            if (rb[i] != sub_src[i])
            {
                return false;
            }
        }

        sub_offset += sub_size;
    }

    return true;
}
#endif
spi_flash_erase_command_t g_command_erase_sets[] =
    {
        [0] = {
            .command = 0x00,
            .size = 0U,
        }};

/* Custom command sets. */
ospi_b_xspi_command_set_t g_command_sets[] =
    {

        /* 8D-8D-8D example with inverted lower command byte. */
        [0] = {.protocol = SPI_FLASH_PROTOCOL_8D_8D_8D,
               .latency_mode = OSPI_B_LATENCY_MODE_VARIABLE,
               .frame_format = OSPI_B_FRAME_FORMAT_XSPI_PROFILE_1,
               .command_bytes = OSPI_RAM_COMMAND_BYTES,
               .address_bytes = SPI_FLASH_ADDRESS_BYTES_4,
               .read_command = OSPI_B_COMMAND_READ,
               .program_command = OSPI_B_COMMAND_WRITE,
               .write_enable_command = OSPI_B_COMMAND_WRITE_ENABLE,
               .status_command = 0x00,
               //.status_needs_address = false,
               //.status_address_bytes = 0,
               //.address_msb_mask = 0xE0,
               .read_dummy_cycles = OSPI_RAM_READ_LATENCY_CYCLES,
               .program_dummy_cycles = OSPI_RAM_WRITE_LATENCY_CYCLES,

               .status_dummy_cycles = 0,
               .p_erase_commands = NULL}};

fsp_err_t ospi_raw_trans(spi_flash_direct_transfer_t *p_trans,
                         uint16_t command, uint8_t cmd_len,
                         uint32_t address, uint8_t addr_len,
                         uint32_t data, uint8_t data_len,
                         uint8_t dummy_cycle, spi_flash_direct_transfer_dir_t dir)
{
    fsp_err_t err = FSP_SUCCESS;

    // Example raw transfer
    p_trans->command = command;
    p_trans->command_length = cmd_len;
    p_trans->address = address;
    p_trans->address_length = addr_len;
    p_trans->data_length = data_len;
    p_trans->data = data;
    p_trans->dummy_cycles = dummy_cycle;

