panda5mt/RA8E1_prj/src/hyperram_integ.c
    return err;
}

/* Note: Mutex is created in hyperram_timing_optimization() */
fsp_err_t hyperram_word_write(uint32_t addr, uint32_t data)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Keep semantics consistent with hyperram_b_read/write: addr is a logical offset. */
    if ((addr & 0x0FU) > 0x0CU)
    {
        /* This 4-byte access would cross a 16-byte address-conversion block. */
        xprintf("[HyperRAM-W] ERROR: word_write crosses 16B boundary (addr=0x%08lx)\n", (unsigned long)addr);
        return FSP_ERR_INVALID_ARGUMENT;
    }

    uint32_t converted_addr = addr;

    err = ospi_raw_trans(&g_ospi0_trans,
                         OSPI_B_COMMAND_WRITE, OSPI_RAM_COMMAND_BYTES,
                         converted_addr, 4,
                         data, 4,
                         OSPI_RAM_WRITE_LATENCY_CYCLES, SPI_FLASH_DIRECT_TRANSFER_DIR_WRITE);
    return err;
}

uint32_t hyperram_word_read(uint32_t addr)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Keep semantics consistent with hyperram_b_read/write: addr is a logical offset. */
    if ((addr & 0x0FU) > 0x0CU)
    {
        /* This 4-byte access would cross a 16-byte address-conversion block. */
        xprintf("[HyperRAM-R] ERROR: word_read crosses 16B boundary (addr=0x%08lx)\n", (unsigned long)addr);
        return 0xFFFFFFFFu;
    }

    uint32_t converted_addr = addr;

    err = ospi_raw_trans(&g_ospi0_trans,
                         OSPI_B_COMMAND_READ, OSPI_RAM_COMMAND_BYTES,
                         converted_addr, 4,
                         0x00, 4,
                         OSPI_RAM_READ_LATENCY_CYCLES, SPI_FLASH_DIRECT_TRANSFER_DIR_READ);

    if (FSP_SUCCESS != err)
    {
        xprintf("[HyperRAM-R] ERROR: word_read failed (err=%d addr=0x%08lx)\n", (int)err, (unsigned long)addr);
        return 0xFFFFFFFFu;
    }

    return g_ospi0_trans.data;
}

fsp_err_t hyperram_b_write(const void *p_src, void *p_dest, uint32_t total_length)
{
    fsp_err_t err = FSP_SUCCESS;

    if (g_hyperram_mutex == NULL)
    {
        xprintf("[HyperRAM-W] ERROR: Mutex not initialized!\n");
        return FSP_ERR_NOT_INITIALIZED;
    }

    // 大きい書き込み（1KB以上）のみログ出力
    // bool verbose = (total_length >= 1024);

    // ミューテックス取得（最大5秒待機 - カメラの大きな書き込みに対応）
    if (xSemaphoreTake(g_hyperram_mutex, pdMS_TO_TICKS(5000)) != pdTRUE)
    {
        // xprintf("[HyperRAM-W] Mutex timeout after 5s!\n");
        return FSP_ERR_TIMEOUT;
    }

    // 排他制御下で書き込み実行
    const uint8_t *src_p8 = (const uint8_t *)p_src;
    uint8_t *dest_p8 = (uint8_t *)p_dest;
    /*
     * Address conversion is 16-byte granular:
     *   converted = ((addr & ~0xF) << 6) | (addr & 0xF)
     * Copying/writing 64 bytes contiguously would span 4 interleaved 16-byte blocks,
     * which can manifest as 4x repeating patterns in image data.
     */
    const uint32_t batch_size = (uint32_t)HYPERRAM_RW_CHUNK_SIZE;
    uint32_t offset = 0;

#if HYPERRAM_WRITE_VERIFY
    uint32_t verify_retries_used = 0;
    uint32_t verify_mismatch_chunks = 0;
    uint32_t verify_failed_chunks = 0;
#endif

    while (offset < total_length)
    {
        uint32_t remaining = total_length - offset;
        uint32_t base_addr = (uint32_t)dest_p8 + offset;
        uint32_t in_block = base_addr & 0x0FU;
        uint32_t to_block_end = 16U - in_block;
        uint32_t write_size = remaining;

        if (write_size > batch_size)
        {
            write_size = batch_size;
        }

#if !HYPERRAM_UNSAFE_RW_CROSS_16B
        if (write_size > to_block_end)
        {
            /* Do not cross a 16-byte address-conversion block. */
            write_size = to_block_end;
        }
#else
        (void)to_block_end;
#endif

        uint32_t adr = (uint32_t)dest_p8 + offset;
        adr += (uint32_t)HYPERRAM_BASE_ADDR;

        /*
         * IMPORTANT:
         * Avoid memcpy() here. Depending on the libc implementation and optimization level,
         * memcpy may generate byte/halfword accesses and/or unaligned transfers. Some OSPI
         * memory-mapped devices/controllers behave poorly with sub-word writes, leading to
         * persistent read-back mismatches.
         *
         * Prefer 32-bit aligned volatile accesses when possible; otherwise fall back to
         * explicit byte-wise volatile writes.
         */
        const uint8_t *src = (const uint8_t *)(src_p8 + offset);
        volatile uint8_t *dst8 = (volatile uint8_t *)adr;

#if HYPERRAM_WRITE_VERIFY
        uint32_t attempt = 0;
        bool ok = false;
        bool wait_before_verify = false;

        while (true)
        {
            /* Write the chunk. */
            if ((((uintptr_t)src | (uintptr_t)dst8 | (uintptr_t)write_size) & 0x3u) == 0u)
            {
                const uint32_t *src32 = (const uint32_t *)src;
                volatile uint32_t *dst32 = (volatile uint32_t *)dst8;
                uint32_t words = write_size >> 2;
                for (uint32_t i = 0; i < words; i++)
                {
                    dst32[i] = src32[i];
                }
            }
            else
            {
                for (uint32_t i = 0; i < write_size; i++)
                {
                    dst8[i] = src[i];
                }
            }

#if HYPERRAM_WV_WAIT_MMAP_IDLE
            /* Only wait when the previous attempt detected a mismatch. */
            if (wait_before_verify)
            {
                ospi_wait_mmap_idle();
                wait_before_verify = false;
            }
#endif
            /* Ensure writes reach the memory-mapped window before we verify. */
            __DSB();
            __ISB();

            /* Read-back and compare. */
            uint8_t rb[HYPERRAM_RW_CHUNK_SIZE];

            if ((((uintptr_t)dst8 | (uintptr_t)write_size) & 0x3u) == 0u)
            {
                const volatile uint32_t *src32 = (const volatile uint32_t *)dst8;
                uint32_t *rb32 = (uint32_t *)rb;
                uint32_t words = write_size >> 2;
                for (uint32_t i = 0; i < words; i++)
                {
                    rb32[i] = src32[i];
                }
            }
            else
            {
                for (uint32_t i = 0; i < write_size; i++)
                {
                    rb[i] = dst8[i];
                }
            }

            ok = true;
            for (uint32_t i = 0; i < write_size; i++)
            {
                if (rb[i] != src[i])
                {
                    ok = false;
                    break;
                }
            }

            if (ok)
            {
                break;
            }

            verify_mismatch_chunks++;
            wait_before_verify = true;
            if (attempt >= (uint32_t)HYPERRAM_WRITE_VERIFY_RETRIES)
            {
#if HYPERRAM_UNSAFE_RW_CROSS_16B
                /*
                 * Do not increase retry count further; instead, fall back to a
                 * safe 16-byte non-crossing rewrite+verify for this chunk.
                 */
                if (hyperram_wv_safe_rewrite_verify(src, dst8, write_size))
                {
                    ok = true;
                    break;
                }
#endif
                verify_failed_chunks++;
                break;
            }

            attempt++;
            verify_retries_used++;
        }
#else
        if ((((uintptr_t)src | (uintptr_t)dst8 | (uintptr_t)write_size) & 0x3u) == 0u)
        {
            const uint32_t *src32 = (const uint32_t *)src;
            volatile uint32_t *dst32 = (volatile uint32_t *)dst8;
            uint32_t words = write_size >> 2;
            for (uint32_t i = 0; i < words; i++)
            {
                dst32[i] = src32[i];
            }
        }
        else
        {
            for (uint32_t i = 0; i < write_size; i++)
            {
                dst8[i] = src[i];
            }
        }
#endif
        offset += write_size;
    }

    /* Ensure all posted writes to the memory-mapped window complete. */
    __DSB();
    __ISB();

#if HYPERRAM_WRITE_VERIFY
    /* Accumulate into global counters under the same mutex protection. */
    g_hyperram_wv_mismatch_chunks += verify_mismatch_chunks;
    g_hyperram_wv_retries += verify_retries_used;
    g_hyperram_wv_failed_chunks += verify_failed_chunks;
#endif

#if HYPERRAM_WRITE_VERIFY && HYPERRAM_WRITE_VERIFY_LOG
    if ((verify_retries_used != 0u) || (verify_failed_chunks != 0u))
    {
        xprintf("[HyperRAM-W] verify: retries=%d mismatch_chunks=%d\n failed_chunks=%d len=%d\n",
                (int)verify_retries_used,
                (int)verify_mismatch_chunks,
                (int)verify_failed_chunks,
                (int)total_length);
    }
#elif HYPERRAM_WRITE_VERIFY
    (void)verify_retries_used;
    (void)verify_mismatch_chunks;
    (void)verify_failed_chunks;
#endif

    // ミューテックス解放
    xSemaphoreGive(g_hyperram_mutex);
    return err;
}

void hyperram_write_verify_counters_reset(void)
{
    /* Best-effort reset; ok if a write is in-flight (diagnostics only). */
    g_hyperram_wv_mismatch_chunks = 0;
    g_hyperram_wv_retries = 0;
    g_hyperram_wv_failed_chunks = 0;
}

void hyperram_write_verify_counters_get(uint32_t *p_mismatch_chunks,
                                        uint32_t *p_retries,
                                        uint32_t *p_failed_chunks)
{
    if (p_mismatch_chunks)
    {
        *p_mismatch_chunks = g_hyperram_wv_mismatch_chunks;
    }
    if (p_retries)
    {
        *p_retries = g_hyperram_wv_retries;
    }
    if (p_failed_chunks)
    {
        *p_failed_chunks = g_hyperram_wv_failed_chunks;
    }
}

uint32_t hyperram_write_verify_is_enabled(void)
{
    return (uint32_t)HYPERRAM_WRITE_VERIFY;
}

uint32_t hyperram_write_verify_retries(void)
{
    return (uint32_t)HYPERRAM_WRITE_VERIFY_RETRIES;
}

fsp_err_t hyperram_b_read(void *p_dest, const void *p_src, uint32_t total_length)
{
    fsp_err_t err = FSP_SUCCESS;

    if (g_hyperram_mutex == NULL)
    {
        xprintf("[HyperRAM-R] ERROR: Mutex not initialized!\n");
        return FSP_ERR_NOT_INITIALIZED;
    }

    // ミューテックス取得（最大5秒待機）
    if (xSemaphoreTake(g_hyperram_mutex, pdMS_TO_TICKS(5000)) != pdTRUE)
    {
        xprintf("[HyperRAM-R] Mutex timeout after 5s!\n");
        return FSP_ERR_TIMEOUT;
    }

