panda5mt/RA8E1_prj/src/hyperram_integ.c
    // 排他制御下で読み込み実行
    uint8_t *dest_p8 = (uint8_t *)p_dest;
    const uint8_t *src_p8 = (const uint8_t *)p_src;
    uint32_t remaining_size = total_length;
    uint32_t current_offset = 0;

    while (remaining_size > 0)
    {
        /*
         * Address conversion is 16-byte granular. Never cross a 16-byte boundary
         * within one memcpy, otherwise data order becomes interleaved.
         */
        uint32_t base_addr = (uint32_t)src_p8 + current_offset;
        uint32_t in_block = base_addr & 0x0FU;
        uint32_t to_block_end = 16U - in_block;
        uint32_t read_size = remaining_size;

        if (read_size > (uint32_t)HYPERRAM_RW_CHUNK_SIZE)
        {
            read_size = (uint32_t)HYPERRAM_RW_CHUNK_SIZE;
        }

#if !HYPERRAM_UNSAFE_RW_CROSS_16B
        if (read_size > to_block_end)
        {
            read_size = to_block_end;
        }
#else
        (void)to_block_end;
#endif

        uint32_t converted_addr = base_addr;
        const volatile uint8_t *src8 = (const volatile uint8_t *)((uintptr_t)HYPERRAM_BASE_ADDR + (uintptr_t)converted_addr);
        uint8_t *dst = (uint8_t *)(dest_p8 + current_offset);

        /* Prefer 32-bit aligned volatile loads when possible; else byte loads. */
        if ((((uintptr_t)src8 | (uintptr_t)dst | (uintptr_t)read_size) & 0x3u) == 0u)
        {
            const volatile uint32_t *src32 = (const volatile uint32_t *)src8;
            uint32_t *dst32 = (uint32_t *)dst;
            uint32_t words = read_size >> 2;
            for (uint32_t i = 0; i < words; i++)
            {
                dst32[i] = src32[i];
            }
        }
        else
        {
            for (uint32_t i = 0; i < read_size; i++)
            {
                dst[i] = src8[i];
            }
        }
        current_offset += read_size;
        remaining_size -= read_size;
    }

    /* Serialize subsequent code vs. memory-mapped reads. */
    __DSB();
    __ISB();

    // ミューテックス解放
    xSemaphoreGive(g_hyperram_mutex);
    return err;
}

void ospi_dmac_cb(transfer_callback_args_t *p_args)
{
    FSP_PARAMETER_NOT_USED(p_args);
    ospi_b_dma_sent = true;
    // xprintf("OSPI DMAC transfer done.\n");
}